src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудник</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПродажи</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товар</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товар</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Продажа/Forms/ФормаДокумента/Module.bsl
// Расчет цен в столбце "Сумма" табличной части

//При смене товара - обнуляем количество
&НаКлиенте
Процедура СоставПродажиТоварПриИзменении(Элемент)
	СтрокаТЧ = Элементы.СоставПродажи.ТекущиеДанные;
	СтрокаТЧ.Количество = 0;
КонецПроцедуры

&НаСервере 
Функция ПолучитьЦену(СпрТовар)
	Возврат СпрТовар.Цена;
КонецФункции

//Расчет суммы по строке табличной части
&НаКлиенте
Процедура СоставПродажиКоличествоПриИзменении(Элемент)   

	СтрокаТЧ = Элементы.СоставПродажи.ТекущиеДанные;
	Товар = СтрокаТЧ.Товар;
	Цена = ПолучитьЦену(СтрокаТЧ.Товар);
	Количество = СтрокаТЧ.Количество;
	КоличествоТовараНаСкладе = ПолучитьКоличествоНаСкладе(Товар);
	Если КоличествоТовараНаСкладе = Неопределено Тогда
		Сообщить("Товар отсутствует на складе");
		СтрокаТЧ.Количество = 0;
	Иначе
		Если КоличествоТовараНаСкладе < Количество Тогда
		Сообщить("Недостаточно товара на складе!");
		СтрокаТЧ.Количество = 0;
	Иначе
		СуммаСтроки = ОбщийМодуль.РассчитатьСумму(Цена, Количество);
		СтрокаТЧ.Сумма = СуммаСтроки;
		Объект.СуммаПродажи = Объект.СоставПродажи.Итог("Сумма");	
	КонецЕсли

	КонецЕсли
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоНаСкладе(СпрТовар)
	
	Попытка 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|ГДЕ 
		|	ОстаткиТоваровОстатки.Товар = &Товар"; 
		
		Запрос.УстановитьПараметр("Товар", СпрТовар);
		РезультатЗапроса = Запрос.Выполнить();
		НаборЗаписей = РезультатЗапроса.Выбрать();

		Пока НаборЗаписей.Следующий() Цикл
			Возврат НаборЗаписей.КоличествоОстаток;
		КонецЦикла;
	Исключение
		Возврат -1;
	КонецПопытки
КонецФункции
